{
    "projects" : [
        {
            "title": "hogspot mobile app",
            "logo": "hogspot",
            "desc": "Developed an Android application that allows users to play a game similar to Geogussr. This app uses the Google Maps API to allow users to explore the Univerity of Arkansas campus. The app has an explore page, search page, user page, and map activity page. Made with Kotlin and Jetpack Compose in Android Studio.",
            "github": "https://github.com/jordicastro/HogSpotmobile",
            "deploy": "",
            "figma": "https://www.figma.com/design/xrbYgHCSm7sGPimuGZez9h/HogSpot-Mobile?node-id=0-1&t=vQHx31NyDjf95mzU-1",
            "isNew": true,
            "id": 1
        },
        {
            "title": "UARK PQC app",
            "logo": "pqc",
            "desc": "Created a web application using Next.js and Supabase to allow researchers to use the UofA’s cryptography equipment for testing their quantum safe algorithms. This app has a landing page, a login page, a submission page, where users can upload their algorithms, and a dashboard, where users can see the status and results of their submissions.",
            "github": "https://github.com/jordicastro/UARK_PQC_app",
            "deploy": "",
            "figma": "https://www.figma.com/design/Us3iXzYjceUpIfsbyWMEzH/capstone-project-mockup?node-id=0-1&node-type=canvas&t=gZY92bB01WgaG0KS-0",
            "isNew": true,
            "id": 2
        },
        {
            "title": "spotify app",
            "logo": "spotify",
            "desc": "Developing a Next.js application that reworks the UI of Spotify, offering a more simplistic, minimal approach with Tailwind. Leveraging Spotify's API to fetch songs and albums, displaying top songs and a custom media player. Currently implementing OAUTH 2.0 to enable users to play albums / playlists backwards, and display their top 10 albums of all time.",
            "github": "https://github.com/jordicastro/spotify-app",
            "deploy": "https://spotify-app-ecru-ten.vercel.app/",
            "figma": "https://www.figma.com/design/YVHiyyWug4qf5XejoBqvhy/spotifyapp?t=zHFsySyeHQCBWQ59-1",
            "isNew": false,
            "id": 3
        },
        {
            "title": "notion app",
            "logo": "notion",
            "desc": "Recreating Notion’s award-winning note-taking app from scratch. Added page routing, improved shortcuts and currently working on code and equation blocks. Made with Next.js.",
            "github": "https://github.com/jordicastro/note-app",
            "deploy": "https://note-app-inky-three.vercel.app/",
            "figma": "https://www.figma.com/design/E1Rsjobw55vy1GRlD4G5ZG/noteapp?node-id=0-1&t=zHFsySyeHQCBWQ59-1",
            "isNew": false,
            "id": 4
        },
        {
            "title": "nfl app",
            "logo": "football",
            "desc": "Utilizes NFL’s API to populate our database. Prompts users to enter SQL queries to update, delete, + view the DB. Made with Next.js and Supabase",
            "github": "https://github.com/jordicastro/NFL-db-app",
            "deploy": "https://nfl-db-app.vercel.app/",
            "figma": "",
            "isNew": false,
            "id": 5
        },
        {
            "title": "portfolio app",
            "logo": "webapp",
            "desc": "This is my web-app. It’s pretty cool! Have you seen the Figma for it? This app displays a list of projects I’ve worked on or am currently working on. An about page is included. Made with React + Vite.",
            "github": "https://github.com/jordicastro/web-app",
            "deploy": "https://jordicastro.github.io/",
            "figma": "https://www.figma.com/design/zbs7P8R4JHCNryLq2drwMN/web-app-mock-up?node-id=0-1&t=K2lPH52FVB29tLky-1",
            "isNew": false,
            "id": 6
        }
    ],
    "about" : [
        {
            "title": "ACM VICE PRESIDENT",
            "date": "JAN 2024 => PRESENT",
            "desc": "I am the Association of Computing and Machinery (ACM) vice president at the University of Arkansas. During my time in the role, I have helped host various events, including meet the professors, where students can delve into UofA research, social and networking events, and this past annual 2024 HogHacks Hackathon, where over 200 students worked in teams to present their innovative projects to a panel of judges. This semester, I ran a React workshop, where I taught students the basics of React with a live coding demo. I also volunteered at my elementary school to help 3rd graders with the Hour of Code.",
            "image": "hoghacks",
            "link": "https://uark-acm.github.io/hoghacks/",
            "id": 1
        },
        {
            "title": "PQC Undergrad Research",
            "date": "AUG 2021 => MAY 2022, JUNE 2024 => DEC 2024",
            "desc": "As a part of my undergraduate honors research, I worked under Dr. Nelson of the University of Arkansas to conduct side channel attacks on post-quantum crypto-graphic algorithms. Utilizing a ChipWhisperer and UFO board, I was able to test the safety of two encryption algorithms using Test Vector Leakage Assessment (TVLA) and present my findings at the University of Arkansas Honors Symposium. This semester, I created a full-stack web application using Next.js that will connect researchers with UofA’s PCQ equipment for leakage testing. Our sponsor will present our paper to the board to receiving funding for the project.",
            "image": "pqcUndergrad",
            "link": "https://github.com/jordicastro/UARK_PQC_app",
            "id": 2
        },
        {
            "title": "Running + Biking",
            "date": "JUNE 2020 => PRESENT",
            "desc": "I enjoy riding on the trails of the Greenway, which extends four cities in Northwest Arkansas: from Bentonville, to Rogers and Springdale, ending in Fayetteville. This semester, I raced the Square 2 Square, starting in Bentonville and ending in Fayetteville. I am also raced my first ever half-marathon in December. My goal for 2025 is to run 1000 miles and to race another half marathon! Follow me on Strava!",
            "image": "strava",
            "link": "https://www.strava.com/athletes/108776798",
            "id": 3
        },
        {
            "title": "Music",
            "date": "APRIL 2003 => PRESENT",
            "desc": "I LOVE MUSIC. I'm constantly listening to music as I head to class, study, or run. Spotify Wrapped was very underwhelming this year. I'm shooting for over 100k minutes listened for next year. Because of my love of music, I have leveraged Spotify’s API to create a Spotify clone. My favorite album is still Un Verano Sin Ti.",
            "image": "spotifywrapped",
            "link": "https://spotify-app-ecru-ten.vercel.app/album/3RQQmkQEvNCY4prGKE6oc5",
            "id": 4
        }

    ]
}